Repository: Beryesa/foss-desktop-turkish
Catalog: KDE/kleopatra._desktop_.po
Languages: tr

# Name
source: Kleopatra Decrypt/Verify Files
tr: Kleopatra Dosyaların Şifrelemesini Aç/Doğrula

# Name
source: Decrypt/Verify File
tr: Dosyaların Şifrelemesini Aç/Doğrula

# Name
source: Kleopatra Decrypt/Verify All Files In Folder
tr: Kleopatra Bu Klasördeki Tüm Dosyaların Şifrelemesini Aç/Doğrula

# Name
source: Decrypt/Verify All Files In Folder
tr: Bu Klasördeki Tüm Dosyaların Şifrelemesini Aç/Doğrula

# Comment
source: Certificate Manager and Unified Crypto GUI
tr: Sertifika Yöneticisi ve Birleşik Şifreleme Arayüzü

# Name
source: Kleopatra Sign/Encrypt Files
tr: Kleopatra Dosyaları İmzala/Şifrele

# Name
source: Sign & Encrypt File
tr: Dosyayı Şifrele ve İmzala

# Name
source: Encrypt File
tr: Dosyayı Şifrele

# Name
source: OpenPGP-Sign File
tr: Dosyayı OpenPGP-İmzala

# Name
source: S/MIME-Sign File
tr: Dosyayı S/MIME-İmzala

# Name
source: Kleopatra Sign/Encrypt Folders
tr: Kleopatra Klasörleri İmzala/Şifrele

# Name
source: Archive, Sign && Encrypt Folder
tr: Klasör Arşivle, İmzala ve Şifrele

# Name
source: Archive && Encrypt Folder
tr: Klasör Arşivle ve Şifrele

# GenericName
source: Certificate Manager and Unified Crypto GUI
tr: Sertifika Yöneticisi ve Birleşik Şifreleme Arayüzü

# GenericName
source: GnuPG Log Viewer
tr: GnuPG Günlük Görüntüleyicisi

# Comment
source: View the GnuPG log
tr: GnuPG günlüğünü görüntüle
