Repository: Beryesa/foss-desktop-turkish
Catalog: KDE/kmail._desktop_.po
Languages: tr

# Comment
source: Archive Mail Agent
tr: Arşiv Posta Aracısı

# Name
source: Archive Mail Agent
tr: Posta Arşivleme Aracısı

# Name
source: Archive Mail finished
tr: Posta Arşivleme tamamlandı

# Name
source: Archive Mail started
tr: Posta Arşivleme başladı

# Name
source: Directory does not exist
tr: Dizin mevcut değil

# Name
source: Archive Mail Error
tr: Posta Arşivleme Hatası

# Comment
source: Followup reminder agent
tr: Takip anımsatma aracısı

# Name
source: Mail Follow Up Received
tr: Posta Takibi Alındı

# Name
source: Followup Reminder Agent
tr: Takip Anımsatma Aracısı

# Comment
source: Followup Reminder Agent allows to remind you when an email was not answered.
tr: Takip anımsatma aracısı, bir e-posta yanıtlanmadığında anımsatılmanızı sağlar.

# Comment
source: Mail Filter Agent
tr: Posta Süzgeç Aracısı

# Name
source: Mail Filter Agent
tr: Posta Süzgeç Aracısı

# Name
source: Mail filter log enabled
tr: Posta süzgeç günlüğü etkin

# Name
source: An error occurred during filtering
tr: Süzme sırasında bir hata oluştu

# Comment
source: Extension to filter emails
tr: E-postaları süzmek için uzantı

# Comment
source: Mail Merge Agent
tr: Posta Birleştirme Aracısı

# Name
source: Mail Merge Agent
tr: Posta Birleştirme Aracısı

# Comment
source: Send Later Agent
tr: Sonra Gönder Aracısı

# Name
source: Mail is sent
tr: Posta gönderildi

# Name
source: Send mail failed
tr: Posta gönderilemedi

# Name
source: Send Later Agent
tr: Sonra Gönder Aracısı

# Name
source: Unified Mailbox Agent
tr: Birleşik Posta Kutusu Aracısı

# Comment
source: Unified Mailbox Agent
tr: Birleşik Posta Kutusu Aracısı

# Name
source: KMail Refresh Settings
tr: K Posta Yenileme Ayarları

# GenericName
source: KMail refresh settings
tr: K Posta yenileme ayarları

# Comment
source: Refresh KMail settings
tr: K Posta ayarlarını yenile

# GenericName
source: TNEF File Viewer (proprietary format used by outlook)
tr: TNEF Dosyası Görüntüleyicisi

# Comment
source: A viewer/extractor for TNEF files
tr: TNEF dosyaları için bir görüntüleyici/çıkarıcı

# Comment
source: KMail
tr: K Posta

# Name
source: Akonadi server sent a warning
tr: Akonadi sunucusu bir uyarı gönderdi

# Comment
source: Akonadi server sent a warning
tr: Akonadi sunucusu bir uyarı gönderdi

# Name
source: Akonadi server sent an error
tr: Akonadi sunucusu bir hata gönderdi

# Comment
source: Akonadi server sent an error
tr: Akonadi sunucusu bir hata gönderdi

# Name
source: A resource is broken
tr: Bir özkaynak bozuk

# Comment
source: A resource change its state to broken
tr: Bir özkaynak, durumunu bozuk olarak değiştirdi

# Name
source: Impossible to send email
tr: E-posta gönderimi olanaksız

# Comment
source: Problem during send mail
tr: E-posta gönderilirken sorun

# Name
source: Archive Mails in Folder done
tr: Dizindeki Postaları Arşivle tamamlandı

# Name
source: Folder Archive Error
tr: Klasör Arşivleme Hatası

# Name
source: Email added to the send later queue
tr: E-posta, daha sonra gönderilecekler kuyruğuna eklendi

# Comment
source: A delayed email delivery is configured and can be canceled
tr: Geciktirilmiş bir e-posta teslimi yapılandırıldı ve iptal edilebilir

# Name
source: KMail view
tr: K Posta görünümü

# Name
source: KMail
tr: K Posta

# GenericName
source: Mail Client
tr: E-posta İstemcisi

# Comment
source: Send, receive and manage your mail with KMail
tr: K Posta ile e-posta gönderin, alın ve yönetin

# Name
source: New Message...
tr: Yeni İleti…

# Name
source: Check Mail
tr: Postayı Denetle
