Repository: Beryesa/foss-desktop-turkish
Catalog: KDE/libplasma._desktop_.po
Languages: tr

# Name
source: Plasma QML/C++ Applet (Qt6)
tr: Plasma QML/C++ Uygulamacığı (Qt6)

# Comment
source: A Plasma Applet template written in an hybrid mix of QML and C++: a Plasma applet template displaying a SVG picture and a text
tr: QML ve C'nin karma bir karışımı içinde yazılmış bir Plasma Uygulamacık şablonu: Bir SVG resmi ve metin gösteren bir Plasma uygulamacığı şablonu

# Name
source: Simple Plasma Wallpaper (Qt6)
tr: Basit Plasma Duvar Kağıdı (Qt6)

# Comment
source: Simple Plasma Wallpaper template: a Plasma wallpaper template displaying a text
tr: Basit Plasma Duvar Kağıdı şablonu: Metin görüntüleyen bir Plasma duvar kağıdı şablonu

# Name
source: Simple Plasma Wallpaper with QML extension (Qt6)
tr: QML uzantısıyla Basit Plasma Duvar Kağıdı (Qt6)

# Comment
source: A Plasma wallpaper which uses custom API provided by an own QML extension plugin
tr: Kendi QML uzantısı tarafından sağlanan özel bir API kullanan bir Plasma duvar kağıdı

# Name
source: Plasma QML Applet (Qt6)
tr: Plasma QML Uygulamacığı (Qt6)

# Comment
source: Plasma QML Applet template: a Plasma applet template displaying a SVG picture and a text
tr: Plasma QML Uygulamacığı şablonu: SVG resmi ve metin gösteren bir Plasma uygulamacığı şablonu

# Name
source: Plasma QML Applet with QML extension (Qt6)
tr: QML uzantısıyla ile Plasma QML Uygulamacığı (Qt6)

# Comment
source: A template for a Plasma applet which uses custom API provided by an own QML extension plugin
tr: Kendi QML eklentisi için sağlanan özel bir API kullanan Plasma uygulamacığı için bir şablon
