Repository: Beryesa/foss-desktop-turkish
Catalog: KDE/sddm-kcm._desktop_.po
Languages: tr

# Name
source: Save Settings
tr: Ayarları Kaydet

# Description
source: Save Settings in SDDM
tr: SDDM içinde Ayarları Kaydet

# Name
source: Install an SDDM theme
tr: Bir SDDM teması kur

# Description
source: Extracts a zip file containing an SDDM theme to the SDDM theme location
tr: SDDM temasını içeren bir zip dosyasını SDDM tema konumuna çıkarır.

# Name
source: Uninstall an SDDM theme
tr: Bir SDDM temasını kaldır

# Description
source: Removes a previously installed SDDM theme
tr: Daha önce kurulmuş bir SDDM temasını kaldırır

# Name
source: Synchronize Settings
tr: Ayarları Eşzamanla

# Description
source: Synchronizes user settings with SDDM settings
tr: Kullanıcı ayarlarını SDDM ayarları ile eşzamanlar

# Name
source: Reset Settings
tr: Ayarları Sıfırla

# Description
source: Resets SDDM settings to factory default state
tr: SDDM ayarlarını fabrika ayarlarına sıfırlar

# Name
source: Login Screen
tr: Oturum Açma Ekranı
