Repository: Beryesa/foss-desktop-turkish
Catalog: KDE/spectacle._desktop_.po
Languages: tr

# GenericName
source: Screenshot Capture Utility
tr: Ekran Görüntüsü Yakalama İzlencesi

# Comment
source: Screenshot capture utility
tr: Ekran görüntüsü yakalama izlencesi

# Keywords
source: snapshot;capture;print;screenshot;snipping;snipping tool;snip;
tr: anlık görüntü;yakala;yazdır;ekran görüntüsü;kırpma;kırpma aracı;kırp;

# Name
source: Capture Entire Desktop
tr: Tam Masaüstünü Yakala

# Name
source: Capture Current Monitor
tr: Geçerli Ekranı Yakala

# Name
source: Capture Active Window
tr: Etkin Pencereyi Yakala

# Name
source: Capture Rectangular Region
tr: Dikdörtgen Bölge Yakala

# Name
source: Capture Window Under Cursor
tr: İmleç Altındaki Pencereyi Yakala

# Name
source: Record Rectangular Region
tr: Dikdörtgen Bölgeyi Kaydet

# Name
source: Record Screen
tr: Ekranı Kaydet

# Name
source: Record Window
tr: Pencereyi Kaydet

# Name
source: Launch without taking a screenshot
tr: Bir Ekran Görüntüsü Almadan Çalıştır

# Comment
source: Screenshot Capture Utility
tr: Ekran Görüntüsü Yakalama İzlencesi

# Name
source: New Screenshot Saved
tr: Yeni Ekran Görüntüsü Kaydedildi

# Comment
source: A new screenshot was captured and saved
tr: Yeni bir ekran görüntüsü yakalandı ve kaydedildi

# Name
source: Recording Saved
tr: Kayıt Kaydedildi

# Comment
source: A recording was captured and saved
tr: Bir kayıt yakalandı ve kaydedildi
