Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Extra/icon-library.master.*.po
Languages: tr

source: Icon Library
tr: Simge Kitaplığı

source: Find the right icon to use on your GNOME application
tr: GNOME uygulamanızda kullanmak için doğru simgeyi bul

source: Icon;Library;Icons;Symbolic;GNOME;GTK;
tr: Icon;Library;Icons;Symbolic;GNOME;GTK;Simge;Kütüphane;Kitaplık;Kitaplığı;Simgeler;

source: Width of the last opened window
tr: Son açılan pencerenin genişliği

source: Height of the last opened window
tr: Son açılan pencerenin yüksekliği

source: Maximized state of the last opened window
tr: Son açılan pencerenin büyütülmüş durumu

source: Enable or disable dark mode
tr: Karanlık kipi etkinleştir veya kapat

source: The default doc-page
tr: Öntanımlı doc-page

source: Symbolic icons for your apps
tr: Uygulamalarınız için sembolik simgeler

source: Find the right icon to use on your GNOME application.
tr: GNOME uygulamanızda kullanmak için doğru simgeyi bul.

source: Main Window
tr: Ana Pencere

source: Export
tr: Dışa Aktar

source: _Save As…
tr: Farklı _Kaydet…

source: _Copy Icon Name
tr: Simge Adını _Kopyala

source: Use in a Mockup
tr: Mockup’da kullan

source: _Copy SVG
tr: SVG _Kopyala

source: Include in an App
tr: Uygulamaya göm

source: Use as a System Icon
tr: Sistem Simgesi olarak kullan

source: License
tr: Lisans

source: Tags
tr: Etiketler

source: In order to use a custom icon in your app, it needs to be shipped as a GResource.
tr: Uygulamanızda özel simge kullanacaksanız simge GResource olarak eklenmelidir.

source: The first step is saving the file in your project directory (e.g. in <b>/data/icons</b>).
tr: İlk adım, dosyayı proje dizininize kaydetmektir (örneğin <b>/data/icons</b> içine).

source: _Save SVG to…
tr: _SVG’yi şuna kaydet…

source: Then you need to include the file in your resource XML file, with a line similar to this:
tr: Ardından, dosyayı şuna benzer bir satırla kaynak XML dosyanıza eklemeniz gerekir∶

source: You should be able to use the icon by setting <i>icon-name</i> property of <i>Gtk.Image</i>
tr: <i>Gtk.Image</i>’in <i>icon-name</i> özelliğinde belirterek simgeyi kullanabilmelisiniz

source: No Resource File?
tr: Kaynak Dosyası Yok Mu?

source: If you don't have a resource file in your project yet, you can start from this example file.
tr: Henüz projenizde kaynak dosyası yoksa, şu örnek dosyadan başlayabilirsiniz.

source: Save _Resource File to…
tr: Kaynak _Dosyasını Şuna Kaydet…

source: <a href='https://docs.gtk.org/gio/struct.Resource.html'>Read more on GResources</a>
tr: <a href='https://docs.gtk.org/gio/struct.Resource.html'>GResources ile ilgili daha çoğunu oku</a>

source: Include the GResource in your app
tr: GResource’u uygulamanıza ekleyin

source: In order for this to work you need to include it in your meson.build, like so:
tr: Bunun çalışması için meson.build dosyanıza eklemelisiniz, şunun gibi∶

source: And then load it in your main file
tr: Ve ardından ana dosyasınıza yükleyin

source: In order for this to work you need to create a bundle out of the <b>GResource</b> file and install it in <b>$prefix/$datadir/$app-name</b>. Here's how you would do it using Meson
tr: Bunun çalışması için <b>GResource</b> dosyası dışında çıkın oluşturmalısınız ve <b>$prefix/$datadir/$app-name</b> içine kurmalısınız. Meson kullanarak bunu nasıl yapabilirsiniz, işte:

source: And then load the bundle in your main file
tr: Ve ardından ana dosyanızdaki çıkını yükleyin

source: In order for this to work you need to include the <b>GResource</b> in the binary.
tr: Bunun çalışması için ikilide <b>GResource</b> bulundurmalısınız.

source: This is a system icon, which means it comes pre-installed as part of the platform.
tr: Bu sistem simgesidir, platformun parçası olarak önceden kuruludur.

source: Note that system icons can change over time, so if you are using this icon because of what it looks like rather than its semantic meaning it would be better to <a href='in-app'>include it with your app</a>.
tr: Sistem simgelerinin zamanla değişebileceğini göz önünde bulundurun; eğer bu simgeyi anlamından öte, benzediği şey için kullanıyorsanız <a href='in-app'>uygulamanızın içine gömmeniz</a> daha iyi olacaktır.

source: These icons come with the operating system, which means you have no control over them and they could change at any time. Only use them if you're sure you are using them in the correct context (e.g. three lines for a primary menu).
tr: Bu simgeler işletim sistemiyle gelir, bunlarda hiçbir denetiminiz yoktur ve her an değişebilirler. Yalnızca doğru bağlamda kullandığınızdan eminseniz kullanın (örneğin: ana menü için üç çizgi).

# shortcut window
source: General
tr: Genel

# shortcut window
source: Search
tr: Ara

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Quit
tr: Çık

source: _Keyboard Shortcuts
tr: Klavye _Kısayolları

source: About Icon Library
tr: Simge Kitaplığı Hakkında

source: Search for icons by name, category or tag
tr: Simgeleri ada, kategoriye veya etikete göre ara

source: Toggle Dark Mode
tr: Karanlık Kipi Aç/Kapat

source: Main Menu
tr: Ana Menü

source: No Results found
tr: Hiçbir Sonuç Bulunamadı

source: Try a different search
tr: Başka arama deneyin

source: translator-credits
tr: Sabri Ünal <libreajans@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Pre-Installed System Icons
tr: Ön Yüklü Sistem Simgeleri

source: Copied
tr: Kopyalandı

source: SVG images
tr: SVG Resimleri

source: Export a symbolic icon
tr: Sembolik simgeyi dışa aktar

source: XML Document
tr: XML Belgesi

source: Export GResource example file
tr: GResource örnek dosyasını dışa aktar

source: Unknown
tr: Bilinmeyen
