Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Extra/niepce.master.*.po
Languages: tr

source: Manage and edit your photos
tr: Fotoğraflarınızı düzenleyin ve yönetin

source: photo;
tr: fotoğraf;

source: Advanced Photo Editing
tr: Gelişmiş Fotoğraf Düzenleme

source: Niepce Digital is an application used to manage and edit photos.
tr: Niepce Digital, fotoğrafları düzenleyen ve yöneten uygulamadır.

source: Features:
tr: Özellikler:

source: Photo library management
tr: Fotoğraf kütüphane yönetimi

source: Non destructive image editing
tr: Bozmadan resim düzenleme

source: RAW processing
tr: HAM işleme

source: Label _7
tr: Etiket _7

source: Label _8
tr: Etiket _8

source: Label _9
tr: Etiket _9

source: Label _10
tr: Etiket _10

source: <b>Labels</b>
tr: <b>Etiketler</b>

source: Edit Labels
tr: Etiketleri Düzenle

source: Import Library
tr: Kütüphaneyi İçe Aktar

source: Folder Roots
tr: Klasör Kökleri

source: Start import
tr: İçe Aktarımı Başlat

source: Import in progress
tr: İçe aktarılıyor

source: All done
tr: Tümü bitti

source: _Reopen Catalog
tr: Katoloğu _Yeniden Aç

source: Write XMP automatically (not recommended)
tr: Kendiliğinden XMP yaz (önerilmez)

source: Use dark interface
tr: Koyu arayüz kullan

source: Preferences
tr: Tercihler
