Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Circle/Curtail.master.*.po
Languages: tr

source: Compress your images
tr: Görüntülerinizi sıkıştırın

source: Optimize your images with Curtail, a useful image compressor that supports PNG, JPEG, WebP and SVG file types.
tr: Curtail, PNG, JPEG, WebP ve SVG dosya türlerini destekleyen kullanışlı bir görüntü sıkıştırıcıdır

source: It supports both lossless and lossy compression modes with an option to whether keep or not metadata of images.
tr: Görüntülerin üst verilerini koruma ya da korumama seçeneğiyle hem kayıpsız hem de kayıplı sıkıştırma kiplerini destekler

source: compress;optimize;image;photo;
tr: compress;optimize;image;photo;sıkıştır;eniyile;resim;görüntü;fotoğraf;

source: Save into a new file
tr: Yeni dosyaya kaydet

source: Save the compressed image into a new file.
tr: Sıkıştırılmış görüntüyü yeni dosyaya kaydet.

source: Enable recursive compression in folders
tr: Klasörlerde özyinelemeli sıkıştırmayı etkinleştir

source: This setting enable compression in a recursive way in folders.
tr: Bu ayar, klasörlerde özyinelemeli sıkıştırmayı etkinleştirir.

source: Preserve metadata
tr: Üst verileri koru

source: This setting preserves metadata of images.
tr: Bu ayar, görüntülerin üst verilerini korur.

source: Preserve file permissions and timestamps if possible
tr: Olabilirse dosya izinlerini ve zaman damgalarını koru

source: This setting file permissions and timestamps of images if possible.
tr: Bu ayar, olabilirse resimlerin zaman damgalarını ve dosya izinlerini korur.

source: Enable lossy mode
tr: Kayıplı modu etkinleştir

source: Use lossy mode to compress images.
tr: Görüntüleri sıkıştırmak için kayıplı kipi kullanın.

source: Suffix to append at end of new file
tr: Yeni dosyanın sonuna eklenecek son ek

source: Suffix to append at end of new file.
tr: Yeni dosyanın sonuna eklenecek son ek.

source: PNG Lossy Compression Level
tr: PNG Kayıplı Sıkıştırma Düzeyi

source: Lossy compression level to use for PNG images.
tr: PNG görüntüler için kullanılacak kayıplı sıkıştırma düzeyi.

source: PNG Lossless Compression Level
tr: PNG Kayıpsız Sıkıştırma Düzeyi

source: Lossless compression level to use for PNG images.
tr: PNG görüntüler için kullanılacak kayıpsız sıkıştırma düzeyi.

source: JPG Lossy Compression Level
tr: JPG Kayıplı Sıkıştırma Düzeyi

source: Lossy compression level to use for JPG images.
tr: JPG görüntüler için kullanılacak kayıplı sıkıştırma düzeyi.

source: WebP Lossy Compression Level
tr: WebP Kayıplı Sıkıştırma Düzeyi

source: Lossy compression level to use for WebP images.
tr: WebP görüntüler için kullanılacak kayıplı sıkıştırma düzeyi.

source: WebP Lossless Compression Level
tr: WebP Kayıpsız Sıkıştırma Düzeyi

source: Lossless compression level to use for WebP images.
tr: WebP görüntüler için kullanılacak kayıpsız sıkıştırma düzeyi.

source: Enable progressive encoding for JPEG images
tr: JPEG görüntüler için aşamalı kodlamayı etkinleştir

source: Optionally encode jpeg images progressively.
tr: İsteğe bağlı olarak jpeg görüntülerini aşamalı olarak kodla.

source: Enable maximum compression for SVG images
tr: SVG görüntüler için azami sıkıştırmayı etkinleştir

source: Enable maximum cleaning of SVG images.
tr: SVG görüntülerin azami temizlenmesini etkinleştir

source: Compression Timeout
tr: Sıkıştırma Zaman Aşımı

source: Compression timeout for each image.
tr: Her görüntü için sıkıştırma zaman aşımı.

# shortcut window
source: General
tr: Genel

# shortcut window
source: Select File
tr: Dosya Seç

# shortcut window
source: Preferences
tr: Tercihler

# shortcut window
source: Keyboard Shortcuts
tr: Klavye Kısayolları

# shortcut window
source: Quit
tr: Çık

source: Preferences
tr: Tercihler

source: General
tr: Genel

source: Safe Mode
tr: Güvenli Kip

source: Save the compressed image in a new file
tr: Sıkıştırılmış görüntüyü yeni dosyaya kaydet

source: New File Suffix
tr: Yeni Dosya Son Eki

source: Recursive Compression
tr: Özyinelemeli Sıkıştırma

source: Enable or disable compression through subdirectories
tr: Alt dizinlerde sıkıştırmayı etkinleştir ya da devre dışı bırak

source: Keep Metadata
tr: Üst Verileri Koru

source: Keep metadata chunks that do not affect rendering
tr: Oluşturmayı etkilemeyen üst veri parçalarını koru

source: Keep File Attributes When Possible
tr: Olabilirse Dosya Özniteliklerini Koru

source: Ensure the new file has the same permissions and timestamps as the original file
tr: Yeni dosyayla özgün dosyanın aynı izin ve zaman damgaları olduğundanemin olun

source: Set the timeout between images
tr: Görüntüler arasındaki zaman aşımını ayarla

source: Formats
tr: Biçimler

source: Lossy Compression
tr: Kayıplı Sıkıştırma

source: Set the quality of the generated image, 100 is the best quality
tr: Oluşturulan görüntünün kalitesini ayarla, 100 en iyi kalitedir

source: Lossless Compression Level
tr: Kayıpsız Sıkıştırma Düzeyi

source: Set the level of the compression, 6 is the highest but slowest level
tr: Sıkıştırma düzeyini ayarla, 6 en yüksek ancak en yavaş düzeydir

source: Progressive Encode
tr: Aşamalı Kodlama

source: Enable incremental image rendering, going from blurry to clear
tr: Bulanıktan netliğe doğru artan görüntü oluşturmayı etkinleştir

source: Maximum Compression Level
tr: Azami Sıkıştırma Düzeyi

source: This can be more destructive for the image
tr: Görüntü için daha bozucu olabilir

source: Bulk Compress Directory
tr: Dizini Toplu Sıkıştır

source: Keyboard Shortcuts
tr: Klavye Kısayolları

source: About Curtail
tr: Curtail Hakkında

source: Browse Files
tr: Dosyalara Göz At

source: Clear Results
tr: Sonuçları Temizle

source: Main Menu
tr: Ana Menü

source: _Change Mode
tr: Kip _Değiştir

source: Images will be overwritten, proceed carefully
tr: Görüntülerin üzerine yazılacak, dikkatli ilerleyin

source: Drop images here to compress them
tr: Sıkıştırmak için görüntüleri buraya bırakın

source: _Browse Files
tr: Dosyalara _Göz At

source: Lossless
tr: Kayıpsız

source: Lossy
tr: Kayıplı

source: Compression has reached the configured timeout of {} seconds.
tr: Sıkıştırma, yapılandırılan {} saniyelik zaman aşımına ulaştı.

source: An unknown error has occurred
tr: Bilinmeyen hata oluştu

source: Can't find the compressed file
tr: Sıkıştırılmış dosya bulunamadı

source: All images
tr: Tüm görüntüler

source: PNG images
tr: PNG görüntüler

source: JPEG images
tr: JPEG görüntüler

source: WebP images
tr: WebP görüntüler

source: SVG images
tr: SVG görüntüler

source: Version not found
tr: Sürüm bulunamadı

source: Skipped
tr: Atlandı

source: More Information
tr: Daha Çok Bilgi

source: Compression was skipped because compressing the file would have resulted in a larger file size.
tr: Dosyanın sıkıştırılması daha büyük dosya boyutuyla sonuçlanacağından sıkıştırma atlandı.

source: Open Image
tr: Görüntü Aç

source: Show in Folder
tr: Klasörde Göster

source: Safe mode with '{}' suffix
tr: '{}' son ekiyle güvenli kip

source: Overwrite mode
tr: Üzerine yazma kipi

source: Browse Directories
tr: Dizinlere Göz At

source: Are you sure you want to compress images in these directories?
tr: Bu dizinlerdeki görüntüleri sıkıştırmak istediğinize emin misiniz?

source: All of the images in the directories selected and their subdirectories will be compressed. The original images will not be modified.
tr: Seçilen dizinlerdeki ve alt dizinlerindeki tüm görüntüler sıkıştırılacak. Özgün görüntüler değiştirilmeyecek.

source: All of the images in the directories selected and their subdirectories will be compressed and overwritten!
tr: Seçilen dizinlerdeki ve alt dizinlerindeki tüm görüntüler sıkıştırılacak ve üzerine yazılacak!

source: Cancel
tr: İptal

source: Compress
tr: Sıkıştır

source: No files found
tr: Dosya bulunamadı

source: This file doesn't exist.
tr: Böyle bir dosya yok.

source: Format of this file is not supported.
tr: Bu dosyanın biçimi desteklenmiyor.

source: translator-credits
tr: Muhammet Emin Akalan <05akalan57@gmail.com> Sabri Ünal <libreajans@gmail.com>

source: Contributors
tr: Katkıda Bulunanlar
