Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Circle/elastic.main.*.po
Languages: tr

source: Design spring animations
tr: Spring canlandırmaları tasarla

source: spring;animation;animations;GNOME;GTK;Adwaita;
tr: spring;animation;animations;GNOME;GTK;Adwaita;canlandırma;animasyon;

source: Use Damping
tr: Sönümleme Kullan

source: Whether to use damping instead of damping ratio.
tr: Sönümleme oranı yerine sönümlemenin kullanılma durumu.

source: Last Language
tr: Son Dil

source: Last selected language.
tr: Son seçilen dil.

source: Elastic allows to design and export spring physics-based animations to use with libadwaita.
tr: Elastic, libadwaita ile kullanmak üzere yay fiziği tabanlı canlandırmalar tasarlamayı ve dışa aktarmayı sağlar.

source: Features:
tr: Özellikler:

source: Preview translation, rotation and scaling transformations.
tr: Çevirme, döndürme ve ölçeklendirme dönüşümlerini ön izleyin.

source: See the animation curve and duration on a graph.
tr: Canlandırma eğrisini ve süresini grafik üzerinde görün.

source: Drag a handle to see it return back with the spring physics.
tr: Yay fiziğiyle geri döndüğünü görmek için bir tutamacı sürükleyin.

source: Export C, JavaScript, Python, Vala or Rust code.
tr: C, JavaScript, Python, Vala ya da Rust kodunu dışa aktarın.

source: Initial screen
tr: İlk ekran

source: Animation graph
tr: Canlandırma grafiği

source: Interactive preview
tr: Etkileşimli ön izleme

source: Code export
tr: Kod dışa aktar

# shortcut window
source: General
tr: Genel

# shortcut window
source: Open Menu
tr: Menüyü Aç

# shortcut window
source: Show Preferences
tr: Tercihleri Göster

# shortcut window
source: Show Shortcuts
tr: Kısayolları Göster

# shortcut window
source: Close Current Window
tr: Geçerli Pencereyi Kapat

# shortcut window
source: Quit App
tr: Uygulamadan Çık

# shortcut window
source: Editor
tr: Düzenleyici

# shortcut window
source: Basic View
tr: Temel Görünüm

# shortcut window
source: Interactive View
tr: Etkileşimli Görünüm

# shortcut window
source: Run Animation
tr: Canlandırma Çalıştır

# shortcut window
source: Toggle Graph
tr: Grafiği Aç/Kapat

# shortcut window
source: Copy Snippet
tr: Parçayı Kopyala

# shortcut window
source: Reset to Defaults
tr: Öntanımlı Değerlere Sıfırla

source: translator-credits
tr: Sabri Ünal <yakushabb@gmail.com> Emin Tufan Çetin <etcetin@gmail.com>

source: Initial Velocity
tr: Başlangıç Hızı

source: Information About Initial Velocity
tr: Başlangıç Hızı Bilgisi

source: Initial velocity affects the beginning of the animation curve without changing duration. This is useful when finishing gestures with an animation, or to make it bounce more in either direction.
tr: Başlangıç hızı, süreyi değiştirmeden canlandırma eğrisinin başlangıcını etkiler. Bu, canlandırmayla hareketleri bitirirken ya da hareketin her iki yönde de daha çok sekmesini sağlamak için kullanışlıdır.

source: Toggle Graph
tr: Grafiği Aç/Kapat

source: Run Animation
tr: Canlandırmayı Çalıştır

source: _Copy Snippet
tr: Parçayı _Kopyala

source: Min: %.2lf
tr: Asgari: %.2lf

source: Max: %.2lf
tr: Azami: %.2lf

source: Duration: %.0lf ms
tr: Süre: %.0lf ms

source: Damping determines how much the spring oscillates. Damping ratio is a more convenient parameter adjusted to behave the same way regardless of mass and stiffness, and most of the time it’s easier to work with. If you need to import values from another framework that uses damping, you can switch to damping instead.
tr: Sönümleme, yayın ne denli salınacağını belirler. Sönümleme oranı, kütle ve sertliğe bağlı olmaksızın aynı davranacak biçimde ayarlanabilen daha uygun bir parametredir ve çoğu zaman daha kolay çalışmak için yeğlenir. Sönümleme kullanan başka bir çerçeveden (framework) değerleri içe aktarmanız gerekiyorsa, sönümlemeye geçiş yapabilirsiniz.

source: Prefer damping instead of damping ratio
tr: Sönümleme oranı yerine sönümleme yeğle

source: Damping
tr: Sönümleme

source: Information About Damping
tr: Sönümleme Bilgisi

source: How much the spring oscillates. Set it to the marked value to bring the spring to rest as soon as possible with no oscillation, lower values to create oscillation, higher values to slow the spring down.
tr: Yayın salınım miktarı. Salınım olmadan yayı en kısa sürede durdurmak için belirtilen değere ayarlayın, salınım oluşturmak için daha düşük değerler, yayı yavaşlatmak için daha yüksek değerler kullanın.

source: Damping Ratio
tr: Sönümleme Oranı

source: Information About Damping Ratio
tr: Sönümleme Oranı Bilgisi

source: How much the spring oscillates. Set it to 1 to bring the spring to rest as soon as possible with no oscillation, lower values to create oscillation, higher values to slow the spring down.
tr: Yayın salınım miktarı. Salınım olmadan yayı en kısa sürede durdurmak için 1 olarak ayarlayın, salınım oluşturmak için daha düşük değerler, yayı yavaşlatmak için daha yüksek değerler kullanın.

source: Mass
tr: Kütle

source: Information About Mass
tr: Kütle Bilgisi

source: The mass of the attached object. The higher the mass is, the longer the spring takes to stop.
tr: Ekli nesnenin kütlesi. Kütle ne denli yüksekse, yayın durması o denli uzun sürer.

source: Stiffness
tr: Sertlik

source: Information About Stiffness
tr: Sertlik Bilgisi

source: The stiffness of the spring. The higher the stiffness is, the faster the spring contracts.
tr: Yayın sertliği. Sertlik ne denli yüksekse, yay o denli hızlı kasılır.

source: Information About Epsilon
tr: Epsilon Bilgisi

source: Determines when to stop the simulation. This value should be large enough that the animation doesn’t last too long, but small enough that there’s no visible jump at the end.
tr: Simülasyonun ne zaman durdurulacağını belirler. Bu değer, canlandırmanın çok uzun sürmemesi için yeterince büyük olmalı, ancak sonunda herhangi bir görünür atlama olmamalıdır.

source: _Reset
tr: _Sıfırla

source: Reset to Defaults
tr: Öntanımlı Değerlere Sıfırla

source: Main Menu
tr: Ana Menü

source: Basic
tr: Temel

source: Interactive
tr: Etkileşimli

source: _Preferences
tr: _Tercihler

source: _Keyboard Shortcuts
tr: _Klavye Kısayolları

source: _About Elastic
tr: Elastic _Hakkında

source: Copied to clipboard
tr: Panoya kopyalandı
