Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Infrastructure/apps-for-gnome.main.*.po
Languages: tr

source: About Us
tr: Hakkımızda

source: App is translated
tr: Uygulama çevrildi

source: App specific content © The respective app contributors
tr: Uygulama özeli içerik © Ayrı ayrı uygulama katkıcıları

source: App supports mobile devices
tr: Uygulama mobil aygıtları destekler

source: Apps featured in this curated overview are all built with the GNOME philosophy in mind. They are easy to understand and simple to use, feature a consistent and polished design and provide a noticeable attention to details. Naturally, they are [free software](https://fsfe.org/freesoftware/) and have committed to being part of a [welcoming and friendly community](https://conduct.gnome.org/). These apps will perfectly integrate with your [GNOME Desktop](https://www.gnome.org/).
tr: Burada sergilenen uygulamalar tümüyle GNOME felsefesiyle inşa edilmiştir. Anlaması kolay ve kullanımları basittir. Tutarlı ve kibar tasarım barındırır, ayrıntıların kolayca göze çarpmasını sağlarlar. Doğal olarak [özgür yazılım](https://fsfe.org/freesoftware/)dırlar, [misafirperver ve dostane topluluğun](https://conduct.gnome.org/) parçası olmaya adanmışlardır. Bu uygulamalar [GNOME Masaüstü](https://www.gnome.org)nüzle kusursuz tümleşecektir.

source: Apps for GNOME
tr: GNOME İçin Uygulamalar

source: Apps supported on GNOME mobile devices are marked with the mobile icon.
tr: GNOME mobil aygıtlarda desteklenen uygulamalar mobil simgesiyle imlenmiştir.

source: Circle
tr: Çevre

source: Circle Apps
tr: Çevre Uygulamalar

source: Close Language Selection
tr: Dil Seçimini Kapat

source: Contact Us
tr: İletişime Geç

source: Contribute
tr: Katkı ver

source: Contribute your ideas or report issues on the app’s issue tracker.
tr: Uygulama hata izleyicisine sorunları ya da görüşlerinizi bildirin.

source: Core
tr: Çekirdek

source: Core Apps
tr: Çekirdek Uygulamalar

source: Development
tr: Geliştirme

source: Development Tools
tr: Geliştirme Araçları

source: Discover the best Apps for GNOME
tr: GNOME için en iyi uygulamaları keşfet

source: Discover the best applications in the GNOME ecosystem and learn how to get involved.
tr: GNOME ekosistemindeki en iyi uygulamaları keşfet ve nasıl katılabileceğini öğren.

source: Donate money
tr: Para bağışla

source: Donate to the GNOME Foundation to support this project.
tr: Bu projeyi desteklemek için GNOME Vakfına bağış yap.

source: Explore the interface
tr: Arayüzü keşfet

source: GNOME Circle contains applications extending the GNOME ecosystem. It champions the great additional software that is available for the GNOME platform. [Learn more about GNOME Circle.](https://circle.gnome.org/)
tr: GNOME Çevre, GNOME ekosistemini genişleten uygulamalar içerir. GNOME platformuna uyumlu harika ek yazılımları destekler. [GNOME Çevre ile ilgili daha çoğunu öğren.](https://circle.gnome.org)

source: GNOME Core apps cover ordinary tasks on the GNOME desktop. They are usually pre-installed on your GNOME system.
tr: GNOME Çekirdek uygulamaları, GNOME masaüstündeki sıradan görevleri kapsar. Genellikle GNOME sisteminize önceden kuruludurlar.

source: GNOME Development tools help develop and design new apps and make it easy to contribute to existing ones.
tr: GNOME Geliştirme araçları; yeni uygulama geliştirmeye, tasarlamaya ve var olanlara katkı sunmaya yardımcıdır.

source: Get in touch
tr: İletişime geç

source: Get involved
tr: Karış

source: Get the app
tr: Uygulamayı al

source: Get to know us
tr: Bizi tanı

source: GitHub account
tr: GitHub hesabı

source: GitLab account
tr: GitLab hesabı

source: Give feedback
tr: Geri bildirim ver

source: Help translate this app into your language.
tr: Bu uygulamayı dilinize çevirmeye yardım edin.

source: Help translating
tr: Çeviriye yardım et

source: Install the latest version from Flathub.
tr: Flathub’dan son sürümü kur.

source: Just chat with the app's community or get help when you are stuck.
tr: Uygulamanın topluluğuyla sohbet edin veya sıkıştığınızda yardım alın.

source: Keywords
tr: Anahtar sözcükler

source: Latest version { version_name } released on { date }.
tr: { date } tarihinde son sürüm { version_name } dağıtıldı.

source: Learn how you can contact the project.
tr: Bu projeyle nasıl iletişime geçeceğinizi öğrenin.

source: Learn how you can contribute to this app.
tr: Bu uygulamaya nasıl katkı verebileceğinizi öğrenin.

source: Learn how you can donate to the developers of this project.
tr: Bu projenin geliştiricilerine nasıl bağış yapabileceğinizi öğrenin.

source: Learn more
tr: Daha çoğunu öğren

source: Maintainer
tr: Bakımcı

source: More Information
tr: Daha çok bilgi

source: Newest Release
tr: En son dağıtım

source: Not translated
tr: Çevrilmedi

source: Only a small part of this app is available in your language.
tr: Bu uygulamanın yalnızca küçük parçası dilinizde kullanılabilir.

source: Overview
tr: Genel Görünüm

source: Page Software
tr: Sayfa Yazılımı

source: Page generated
tr: Sayfa oluşturulma:

source: Partially translated
tr: Bir bölümü çevrildi

source: Privacy
tr: Gizlilik

source: Project homepage
tr: Proje ana sayfası

source: Releases
tr: Dağıtımlar

source: Select Language
tr: Dil Seç

source: Some parts of this app are available in your language.
tr: Bu uygulamanın bazı bölümleri dilinizde kullanılabilir.

source: Sparsely translated
tr: Azıcık çevrildi

source: Switch Language
tr: Dil Değiştir

source: The GNOME Project
tr: GNOME Projesi

source: This app is available in your language.
tr: Bu uygulama dilinizde kullanılabilir.

source: This app is not available in your language.
tr: Bu uygulama, dilinizde kullanılamaz.

source: This website is available in many languages
tr: Bu web sitesi birçok dilde kullanılabilir

source: Visit the dedicated homepage for this project.
tr: Bu proje için ayrılmış ana sayfaya git.

source: Visit the online help page for this app.
tr: Bu uygulamanın çevrim içi yardım sayfasına git.

source: Website
tr: Web sitesi

source: {} account
tr: {} hesabı

source: © The “Apps for GNOME” contributors
tr: © “GNOME İçin Uygulamalar” katkıcıları
