Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Infrastructure/ui.main.*.po
Languages: tr

source: There are many ways to contribute to GNOME user experience. If you are new and want to help out, here are some great ways to get started:
tr: GNOME kullanıcı deneyimine katkıda bulunmanın birçok yolu vardır. Yeniyseniz ve yardım etmek istiyorsanız, işte başlamak için bazı harika yollar:

source: Try contributing user experience changes directly to GNOME modules. This can include even simple changes such as icon or text label changes.
tr: Kullanıcı deneyimi değişiklikleri için doğrudan GNOME modüllerine katkıda bulunmayı deneyin. Bu, simge veya metin etiketi değişiklikleri gibi çok basit değişiklikleri bile içerebilir.

source: Report user experience problems in GNOME’s issue trackers.
tr: Kullanıcı deneyimi sorunlarını GNOME’un sorun izleyicilerine bildirin.

source: Help out in the issue trackers of GNOME modules, to review reports and help to find solutions to design problems.
tr: GNOME modüllerinin sorun izleyicilerine yardımcı olun, bildirileri inceleyin ve tasarım sorunlarına çözüm bulmaya çalışın.

source: These activities will often require you to work with the design team to come up with solutions to design problems.
tr: Bu etkinlikler genellikle tasarım sorunlarına çözüm bulmak için tasarım takımıyla birlikte çalışmanızı gerektirecektir.

source: The Websites Team maintains pages like [This Week in GNOME](https://thisweek.gnome.org/), [Apps for GNOME](https://apps.gnome.org/), and many more. You can find an overview of all websites on our [team page](https://gitlab.gnome.org/Teams/Websites/). The websites team is supported by the work of the design and infrastructure teams.
tr: Web Siteleri Takımı [GNOME’da Bu Hafta](https://thisweek.gnome.org/), [GNOME İçin Uygulamalar](https://apps.gnome.org/) gibi daha birçok sayfanın bakımını yapmaktadır. Tüm web sitelerine genel bakışı [takım sayfamızda](https://gitlab.gnome.org/Teams/Websites/) bulabilirsiniz. Web siteleri takımı, tasarım ve alt yapı takımlarının çalışmalarıyla desteklenmektedir.

source: Translating websites
tr: Web sitelerinin çevrilmesi

source: Reporting issues
tr: Sorunların bildirilmesi

source: Oftentimes a website has a link to its repository at the bottom of the page. If you can’t figure out the correct place to report an issue you can check the [Website Team’s page](https://gitlab.gnome.org/Teams/Websites/) for the respective website. This page also gives you a place to report issues without knowing the correct website or for more general issues.
tr: Web sitesi, çoğu zaman sayfanın altında kendi deposuna bağlantı barındırır. Sorun bildirmek için doğru yeri bulamazsanız, ilgili web sitesi için [Web Sitesi Takımının sayfasını](https://gitlab.gnome.org/Teams/Websites/) gözden geçirebilirsiniz. Bu sayfa ayrıca doğru web sitesini bilmeseniz bile daha genel sorunlar için sorun bildirebileceğiniz yer sağlar.

source: Working on websites
tr: Web siteleri üzerinde çalışmak

source: The work on websites highly differs from website to website. For getting started it is a good idea to resist the temptation to redesign a whole website or even the whole of all websites. Instead, you can check the [team’s issue tracker](https://gitlab.gnome.org/groups/Teams/Websites/-/issues/) for open issues. You can also check what website suits you technology wise: While some websites are written in Sphinx, Jekyll, or plain HTML, others are based on more complex Rust code.
tr: Web sitelerindeki çalışmalar web sitesinden web sitesine büyük ölçüde değişiklik gösterir. Başlarken, tüm bir web sitesini ve hatta tüm web sitelerini yeniden tasarlamak gibi dürtülere direnmek iyi bir fikirdir. Bunun yerine, açık sorunlar için [takımın sorun izleyicisini](https://gitlab.gnome.org/groups/Teams/Websites/-/issues/) gözden geçirebilirsiniz. Ayrıca hangi web sitesinin size teknoloji bakımından uygun olduğunu da inceleyebilirsiniz: Bazı web siteleri Sphinx, Jekyll ya da düz HTML ile yazılırken, diğerleri daha karmaşık Rust kodlarına dayanmaktadır.

source: Useful apps
tr: Yararlı uygulamalar
