Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Infrastructure/ui.main.*.po
Languages: tr

source: All participants are expected to follow this Code of Conduct
tr: Tüm katılımcıların bu Davranış Kurallarına uyması beklenmektedir

source: App name…
tr: Uygulama adı…

source: Apps for GNOME
tr: GNOME İçin Uygulamalar

source: As a Core app, it is also pre-installed on [GNOME OS Nightly](https://os.gnome.org/) which you can install as a virtual machine.
tr: Sanal makine olarak kurabileceğiniz [GNOME OS Gecelik](https://os.gnome.org/)’te de Çekirdek uygulama olarak önceden kuruludur.

source: Brand Book
tr: Marka Kitabı

source: Building blocks for modern GNOME apps
tr: Çağdaş GNOME uygulamaları için yapı taşları

source: Chat for discussing websites
tr: Web sitelerini tartışma konuşması

source: Clone Repository
tr: Depoyu Klonla

source: Clone Repository…
tr: Depoyu Klonla…

source: Close Language Selection
tr: Dil Seçimini Kapat

source: Code Repository
tr: Kod Deposu

source: Code of Conduct
tr: Davranış Kuralları

source: Contact
tr: İletişim

source: Contrast
tr: Kontrast

source: Design
tr: Tasarım

source: Design Team on GitLab
tr: GitLab’da Tasarım Takımı

source: Design team issue tracking and work archive
tr: Tasarım takımı sorun izleme ve çalışma arşivi

source: Design user interfaces, user experience, and visuals
tr: Kullanıcı arayüzü, kullanıcı deneyimi ve görsel tasarla

source: Developer Center
tr: Geliştirici Merkezi

source: Documentation
tr: Belgendirme

source: Edit this Page
tr: Bu Sayfayı Düzenle

source: Engage
tr: Etkileşim

source: Explore all the GNOME-related chat rooms in our Matrix space
tr: GNOME ile ilgili tüm konuşma odalarını Matrix alanımızda keşfet

source: Explore which languages can be used to write GNOME apps
tr: Hangi dillerde GNOME uygulamaları yazılabildiğini keşfet

source: Feedback
tr: Geri Bildirim

source: First, you can fork *{2}* via the [{1} page]({0}). You only need to do this once for every project you work on.
tr: *{2}*, [{1} sayfasından]({0}) çatallanabilir. Bunu, üstünde çalıştığınız her proje için yalnızca bir kez yapmalısınız.

source: Foundation News
tr: Vakıf Haberleri

source: GNOME Circle
tr: GNOME Çevre

source: GNOME Code of Conduct
tr: GNOME Davranış Kuralları

source: GNOME Development Center
tr: GNOME Geliştirme Merkezi

source: GNOME Foundation
tr: GNOME Vakfı

source: GNOME Handbook
tr: GNOME El Kitabı

source: GNOME Nightly
tr: GNOME Gecelik

source: GSoC is an online mentoring program focused on introducing new contributors to open source software development.
tr: GSoC, yeni katılımcıları açık kaynaklı yazılım geliştirmeyle tanıştırmaya odaklanan çevrim içi danışmanlık programıdır.

source: GTK is built on libraries like GLib and GIO
tr: GTK, GLib ve GIO gibi kütüphaneler üzerine kurulmuştur

source: GTK is the underlying library for the user interface
tr: GTK, kullanıcı arayüzünün altında yatan temel kütüphanedir

source: GTK&nbsp;4 Docs
tr: GTK&nbsp;4 Belgeleri

source: GTK&nbsp;4 docs
tr: GTK&nbsp;4 belgeleri

source: Get help in the matrix channel of the translation project
tr: Çeviri projesinin Matrix kanalında yardım al

source: Help to translate software and websites into your language
tr: Yazılım ve web sitelerini dilinize çevirmeye yardım edin

source: Home of the Websites Team on GitLab
tr: GitLab’deki Web Siteleri Takımının Ana Sayfası

source: How to use GTK, the underlying library for user interfaces, and other libraries
tr: Kullanıcı arayüzlerinin altında yatan GTK ve diğer kütüphaneler nasıl kullanılır

source: If you are overwhelmed by working on an existing GNOME app, you can also look into [building your own app]({0}) for learning purposes first.
tr: Var olan GNOME uygulaması üstünde çalışmaktan çekiniyorsanız, önce öğrenme amacıyla [kendi uygulamanızı oluşturmaya]({0}) da bakabilirsiniz.

source: If you found an issue or want to propose a change you should try to make sure you have tried out the latest version of {0}. You can check the current version in the app’s “About” section.
tr: Sorun bulduysanız ya da değişiklik önermek istiyorsanız, önce {0} uygulamasının en son sürümünü denediğinizden emin olmaya çalışın. Kullandığınız sürümü uygulamanın “Hakkında” bölümünden denetleyebilirsiniz.

source: Install Builder
tr: Builder Kur

source: Install Nightly
tr: Gecelik Kur

source: Install from Flathub
tr: Flathub’dan Kur

source: Install latest build of the app
tr: Uygulamanın son inşasını kur

source: Install latest version of the app from Flathub
tr: Uygulamanın son sürümünü Flathub’dan kur

source: Install the Builder app from Flathub
tr: Builder uygulamasını Flathub’dan kur

source: Issue Tracker
tr: Sorun İzleyici

source: JavaScript Bindings Reference
tr: JavaScript Bağlamaları Referansı

source: Latest Release
tr: Son Sürüm

source: Learn how you can contribute to the GNOME project
tr: GNOME projesine nasıl katkıda bulunabileceğinizi öğrenin

source: Learn how you can publish your app on Flathub
tr: Uygulamanızı Flathub’da nasıl yayınlayabileceğinizi öğrenin

source: Learn more about GNOME nightly apps.
tr: GNOME gecelik uygulamalarıyla ilgili daha çok bilgi edin.

source: Learn more about how to translate this app
tr: Bu uygulamayı nasıl çevirebileceğinizle ilgili daha çok bilgi edinin

source: Learn more about this app on apps.gnome.org
tr: apps.gnome.org’da bu uygulamayla ilgili daha çok bilgi edin

source: Libadwaita Docs
tr: Libadwaita Belgeleri

source: Libadwaita docs
tr: Libadwaita belgeleri

source: Maintain websites and create content
tr: Web sitelerine bakım yap ve içerik oluştur

source: Mastodon Account
tr: Mastodon Hesabı

source: Matrix Community
tr: Matrix Topluluğu

source: Matrix channel for all Vala related questions
tr: Vala ile ilgili tüm sorular için Matrix kanalı

source: Matrix channel for all questions related to JavaScript in GNOME
tr: GNOME’da JavaScript ile ilgili tüm sorular için Matrix kanalı

source: Matrix channel for all questions related to Python in GNOME
tr: GNOME’da Python ile ilgili tüm sorular için Matrix kanalı

source: Merch
tr: Ürünler

source: More API References
tr: Daha Çok API Referansı

source: More about the translation project in GNOME
tr: GNOME çeviri projesiyle ilgili daha çok bilgi

source: More documentation for GObject libraries
tr: GObject kütüphaneleri için daha çok belge

source: News
tr: Haberler

source: No apps matching the given search found.
tr: Verilen aramayla eşleşen uygulama bulunamadı.

source: Now, we have to let git in your local project know of your personal copy on {0} via this URL. For this we need to go back to the command line. First, you have to change ([`cd`](https://www.gnu.org/software/bash/manual/bash.html#index-cd)) into the project you have been working on. Afterwards you can use the command
tr: Şimdi, bu URL aracılığıyla yerel projenizdeki git’e {0} üstündeki kişisel kopyanızı bildirmemiz gerekiyor. Bunun için komut satırına geri dönmeliyiz. İlk olarak, üzerinde çalıştığınız dizine geçmeniz ([`cd`](https://www.gnu.org/software/bash/manual/bash.html#index-cd)) gerekiyor. Ardından şu komutu kullanabilirsiniz

source: On this page you can learn how to contribute to *{0}*. If you are interested in general information about this app, please visit the [Apps for GNOME page]({1}).
tr: Bu sayfada, nasıl *{0}* katkıcısı olabileceğinizi öğrenebilirsiniz. Bu uygulamayla ilgili genel bilgi almak istiyorsanız, lütfen [GNOME İçin Uygulamalar sayfasına]({1}) uğrayın.

source: Outreachy provides internships to people subject to systemic bias and impacted by underrepresentation in the technical industry where they are living.
tr: Outreachy, sistemik yanlılığa uğrayan ve yaşadıkları yerde teknik endüstride yetersiz temsil edilmekten etkilenenlere staj olanağı sağlamaktadır.

source: Overview
tr: Genel Bakış

source: Overview of many important development resources for GNOME
tr: GNOME için birçok önemli geliştirme kaynağına genel bakış

source: Page generated {0}
tr: Sayfa {0}’da oluşturuldu

source: Planet GNOME
tr: GNOME Gezegeni

source: Privacy Policy
tr: Gizlilik İlkesi

source: Programming
tr: Programlama

source: Programming Languages
tr: Programlama Dilleri

source: Programming language…
tr: Programlama dili…

source: Project translation on Weblate hosting
tr: Proje çevirisi Weblate’te barındırılıyor

source: Publish on Flathub
tr: Flathub’da Yayınla

source: Random suggestions out of available apps.
tr: Kullanılabilir uygulamalardan gelişigüzel öneriler.

source: Repository URL
tr: Depo URL’si

source: Resources
tr: Kaynaklar

source: Rust GTK Core docs
tr: Rust GTK Core belgeleri

source: Rust GTK&nbsp;4 docs
tr: Rust GTK&nbsp;4 belgeleri

source: Rust libadwaita docs
tr: Rust libadwaita belgeleri

source: Select Language
tr: Dil Seç

source: Some of our websites are translated into different languages. You can find the translations in the [*Infrastructure* category]({0}).
tr: Web sitelerimizden bazıları kimi dillere çevrilmiştir. Çevirileri [*Alt Yapı* başlığı altında]({0}) bulabilirsiniz.

source: Style guide for designing print material and websites for GNOME
tr: GNOME basılı materyal ve web sitesi tasarımları için biçem kılavuzu

source: The URL is available under the button “Code” below “SSH.”
tr: URL, “SSH” altındaki “Code” düğmesinin altındadır.

source: The app’s Matrix chat for project specific questions
tr: Uygulamanın, projeye özel sorular için Matrix konuşması

source: The app’s translation status on GNOME’s localization system
tr: Uygulamanın GNOME’un yerelleştirme sistemindeki çeviri durumu

source: The first step is to create a [new {0} account]({1}) if you don’t own one already. You just have to use the linked webform for that.
tr: İlk adım, henüz yoksa [yeni {0} hesabı]({1}) açmanızdır. Yalnızca bağlantıdaki formu doldurmanız yeterli.

source: The latest released version on Flathub is version {0}.
tr: Flathub’da en son {0} sürümü yayınlanmıştır.

source: The main channel for GNOME design discussions
tr: GNOME tasarım tartışmalarının ana kanalı

source: The project’s home, keeping the source code and more information
tr: Projenin kaynak kodunu ve daha çok bilgiyi bulunduran ana sayfası

source: The “GNOME Newcomers” chat can help you get started
tr: “GNOME Yeni Gelenler” konuşması başlamanıza yardımcı olabilir

source: The “Rust ❤️ GNOME” Matrix channel: All about using Rust in GNOME
tr: “Rust ❤️ GNOME” Matrix kanalı: GNOME’da Rust kullanmakla ilgili her şey

source: This Week in GNOME
tr: GNOMEʼda Bu Hafta

source: This app is built with the *{0}* programming language.
tr: Bu uygulama *{0}* programlama diliyle yazılmıştır.

source: This is especially helpful during the [feature freeze period](https://wiki.gnome.org/ReleasePlanning/Freezes) which is dedicated to finding and fixing bugs.
tr: Bu, özellikle hataları bulma ve çözmeye ayrılmış [özellik dondurma sürecinde](https://wiki.gnome.org/ReleasePlanning/Freezes) yararlıdır.

source: This page
tr: Bu sayfa

source: To suggest changes to a project, you first have to create your own copy of the project on {0}. Creating this copy is also referred to as *forking*. You will need your own copy – or *fork* – of the project to upload your changes to this copy.
tr: Projeye değişiklikler önermek için, ilk önce {0} üzerinde kendi kopyanızı oluşturmanız gerekir. Bu kopyanın oluşturulması *çatallama* olarak da geçer. Değişikliklerinizi yüklemek için kendi kopyanıza - ya da *çatalınıza* - gereksineceksiniz.

source: Translate on Weblate
tr: Weblate üzerinden çevir

source: Translate this app
tr: Bu uygulamayı çevir

source: Translation
tr: Çeviri

source: Translation Project
tr: Çeviri Projesi

source: Translation on Damned Lies
tr: Damned Lies üzerinden çevir

source: Typography
tr: Tipografi

source: Use GNOME’s infrastructure to host your project
tr: Projenizi barındırmak için GNOME’un alt yapısını kullanın

source: View all GNOME Teams
tr: Tüm GNOME Takımlarını Görüntüle

source: View existing issues and feature requests or add new ones
tr: Var olan sorunları ve özellik isteklerini görüntüle ya da yenilerini ekle

source: View issues labeled “Newcomer” in the issue tracker
tr: Sorun izleyicide “Yeni Gelenler” olarak etiketlenmiş sorunları görüntüle

source: We begin with some preparations on {0}, where the project is hosted. This process might look quite involved if you are going through it for the first time, but you will become much more accustomed to it over time.
tr: Projenin barındırıldığı {0} üzerinde bazı hazırlıklarla başlıyoruz. Bu işlem, ilk kez yapıyorsanız oldukça karmaşıkmış gibi görünebilir ancak zamanla alışırsınız.

source: We now have to find out the SSH URL for your fork. You can find it on the page you are redirected to after creating the fork. The page of the fork will also be listed on your profile.
tr: Şimdi çatalınız için SSH URL’sini bulmamız gerekiyor. Bunu çatalı oluşturduktan sonra yönlendirildiğiniz sayfada bulabilirsiniz. Çatalın sayfası profilinizde de listelenecektir.

source: Websites
tr: Web Siteleri

source: Websites Team
tr: Web Siteleri Takımı

source: Welcome to GNOME
tr: GNOME’a Hoş Geldiniz

source: Write code and engineer technical solutions
tr: Kod yaz ve teknik çözümler üret

source: Write documentation, help pages, and manuals
tr: Belge, yardım sayfası ve kullanım kılavuzları yaz

source: You can do this by [manually building the app](#getting-the-app-to-build) and trying it out.
tr: Bunu, uygulamayı [elle inşa edip](#getting-the-app-to-build) deneyerek yapabilirsiniz.

source: You now have to add your public SSH key to the [“SSH Keys” setting]({0}) on {1}. Public SSH keys are stored in the `.ssh` folder in your home directory as files with the ending `.pub`. You can print all your public SSH keys via the command `cat ~/.ssh/*.pub`. You can also view the public SSH keys using the *Passwords and Keys* app.
tr: Şimdi, genel SSH anahtarınızı {1} üzerindeki [“SSH Anahtarları” ayarına]({0}) eklemeniz gerekir. Genel SSH anahtarları ev dizininizdeki `.ssh` klasöründe sonu `.pub` ile biten dosyalar olarak saklanır. Tüm genel SSH anahtarlarınızı `cat ~/.ssh/*.pub` komutu ile yazdırabilirsiniz. Ayrıca *Parolalar ve Anahtarlar* uygulamasını kullanarak da genel SSH anahtarlarını görüntüleyebilirsiniz.

source: YouTube Channel
tr: YouTube Kanalı

source: © 2022–{} The “Welcome to GNOME” contributors
tr: © 2022–{} “GNOMEʼa Hoş Geldiniz” katkıcıları

source: “Newcomer” issues
tr: “Yeni Gelenler” sorunları

source: Translating the app
tr: Uygulamanın çevrilmesi

source: The original text in apps is usually written in American English. The translation into other languages can be added by translators separately. The translation usually encompasses the apps’ user interface as well as the metadata shown in places like [Software](https://apps.gnome.org/app/org.gnome.Software/) or [apps.gnome.org](https://apps.gnome.org). Common abbreviations used in this context are *l10n* (localization) and *i18n* (internationalization).
tr: Uygulamalardaki özgün metin genellikle Amerikan İngilizcesi ile yazılır. Diğer dillere çeviri, çevirmenlerce ayrıca eklenebilir. Çeviri genellikle uygulamaların kullanıcı arayüzünün yanı sıra [Yazılımlar](https://apps.gnome.org/app/org.gnome.Software/) ya da [apps.gnome.org](https://apps.gnome.org) gibi yerlerde gösterilen üst verileri de kapsar. Bu bağlamda kullanılan yaygın kısaltmalar *l10n* (yerelleştirme, İngilizce “localization”) ve *i18n* (uluslararasılaştırma, İngilizce “internationalization”) biçimindedir.

source: It looks like this app does not provide a way to be translated, yet. Feel free to file an issue against the project to ask for a way to translate this app.
tr: Bu uygulama çevrilmek için yöntem sunmuyor gibi görünüyor. Bu uygulamayı çevirmenin yolunu sormak için projeye sorun bildiriminde bulunmaktan çekinmeyin.

source: The translation of this project is managed via Weblate hosting. This platform is not part of the GNOME project.
tr: Bu projenin çevirileri Weblate üzerinden yönetilmektedir. Bu platform, GNOME projesinin parçası değildir.

source: This app is translated via the [GNOME translation system](https://l10n.gnome.org) called *Damned Lies*.
tr: Bu uygulama, *Damned Lies* olarak adlandırılıan [GNOME çeviri sistemi](https://l10n.gnome.org) üzerinden çevirilmiştir.

source: Trying the latest version
tr: En son sürümün denenmesi

source: For technical reasons, the latest version of this app cannot be easily tested. This is the case for very few apps that need tight integration with the system.
tr: Teknik nedenlerden dolayı, bu uygulamanın en son sürümü kolayca denenemez. Bu, yalnızca sistemle sıkı tümleşim gerektiren çok az sayıda uygulama için geçerlidir.

source: When reporting an issue or suggesting a feature, it can be helpful to base the report on the latest version of the app. To this end, you can check the installation methods below.
tr: Sorun bildirirken ya da özellik önerirken, bildirinin uygulamanın en son sürümüne dayandarılması yararlı olabilir. Bu doğrultuda, aşağıdaki kurulum yöntemlerini gözden geçirebilirsiniz.

source: Installation from Flathub
tr: Flathubʼdan kurulum

source: Installing a nightly build
tr: Gecelik inşadan kurulum

source: This app allows to install a version of its current development status. Such installations were traditionally generated each night, giving them the name “nightly builds.” Nowadays, they are usually regenerated whenever the main development version changes.
tr: Bu uygulama, güncel geliştirme durumunun bir sürümünü kurmaya izin verir. Bu tür kurulumlar geleneksel olarak her gece üretilir ve “gecelik inşa” olarak adlandırılırdı. Şimdilerde ise, genellikle ana geliştirme sürümü değiştiğinde yeniden üretilirler.

source: **Warning:** Nightly builds of apps should only be used for testing and not for actual tasks. You can identify nightly builds of the app on your system via the stripes in the app’s icon and the stripes in the app’s headerbar. They usually use a different configuration than other installations of this app. However, there is no guarantee that the installation of these apps will work as intended. Never work on data with nightly builds of apps without having backups available.
tr: **Uyarı:** Uygulamaların gecelik inşaları yalnızca sınama amaçlı kullanılmalı, gerçek işler için kullanılmamalıdır. Sisteminizdeki uygulamanın gecelik inşalarını, uygulamanın simgesindeki ve başlık çubuğundaki çizgilerden ayırt edebilirsiniz. Genellikle, bu uygulamanın diğer kurulumlarından başka yapılandırma kullanırlar. Ancak, bu uygulamaların kurulumunun amaçlandığı gibi çalışacağının garantisi yoktur. Yedekleriniz olmadan asla uygulamaların gecelik inşalarıyla verileriniz üzerinde çalışmayın.

source: This app does not currently provide information on where to inspect issues.
tr: Bu uygulama, şu anda sorunların nerede inceleneceğine ilişkin bilgi sağlamamaktadır.

source: Quality testing
tr: Nitelik sınaması

source: Catching issues and regressions before they land in a stable release is very valuable for a project. You can help with this by trying out an upcoming release.
tr: Kararlı sürüme ulaşmadan önce sorunları ve gerilemeleri yakalamak bir proje için çok değerlidir. Yaklaşan sürümleri deneyerek bu konuda yardımcı olabilirsiniz.

source: Chasing issues
tr: Sorunların izini sürmek

source: For many apps, the issue tracker is a central place for coordination of app development. It is not only used to track all existing problems but also to plan new features and other miscellaneous tasks.
tr: Birçok uygulama için sorun izleyici, uygulama geliştirmenin eş güdümü için ana yerdir. Yalnızca var olan tüm sorunları izlemek için değil, aynı zamanda yeni özellikleri ve diğer türlü görevleri planlamak için de kullanılır.

source: The nightly version can also be installed via [Console](https://apps.gnome.org/app/org.gnome.Console/) if the nightly repository is already [configured](http://nightly.gnome.org).
tr: Gecelik sürüm, eğer gecelik depo önceden [yapılandırılmışsa](http://nightly.gnome.org) [Konsol](https://apps.gnome.org/app/org.gnome.Console/) üzerinden de kurulabilir.

source: Reporting found issues
tr: Bulunan sorunları bildirmek

source: Reporting issues you found when using the app can be of high value for app maintainers. However, processing issue reports can also take considerable amount of time. You can take on some of the work by trying the following steps:
tr: Uygulamayı kullanırken bulduğunuz sorunları bildirmek, uygulama bakımcıları için çok değerli olabilir. Ancak, sorun bildirilerini işlemek de önemli ölçüde zaman alabilir. Aşağıdaki adımları deneyerek işin bir bölümünü üstlenebilirsiniz:

source: You can do this by trying out the nightly build of the app.
tr: Bunu, uygulamanın gecelik inşasını deneyerek yapabilirsiniz.

source: Search the issue tracker to find out if the issue has already been reported.
tr: Sorunun daha önce bildirilip bildirilmediğini öğrenmek için sorun izleyicide arama yapın.

source: Check if the issue also exists in the [latest version of the app](#trying-the-latest-version).
tr: Sorunun [uygulamanın en son sürümünde](#trying-the-latest-version) de olup olmadığını denetleyin.

source: If applicable, try to find out under which exact circumstances the problem occurs.
tr: Yapılabiliyorsa, sorunun tam olarak hangi koşullar altında ortaya çıktığını bulmaya çalışın.

source: Report all potentially relevant information, like the version of the app that expose the behavior.
tr: İlgili davranışı ortaya çıkaran uygulama sürümü gibi olası tüm ilgili bilgileri bildirin.

source: Diagnosing listed issues
tr: Listelenen sorunların saptanması

source: Tracking down the exact cause of an issue can be a very important task. Especially for issues tagged with labels like “Needs Diagnosis” or “Needs Information.” If you can reproduce, that is, trigger the reported problem yourself, you can try to dig deeper. This can go from finding out under which exact conditions the issue appears, over running the app with [debug output enabled](https://developer-old.gnome.org/glib/unstable/glib-running.html), to adding debug outputs to the code that narrow down the problem.
tr: Sorunun tam nedenini bulmak, özellikle “Tanı Gerekli” ya da “Bilgi Gerekli” gibi etiketlerle imlenmiş sorunlar için çok önemli bir iş olabilir. Bildirilen sorunu kendiniz yeniden üretebiliyorsanız, yani tetikleyebiliyorsanız, daha derinlere inmeyi de deneyebilirsiniz. Bu, sorunun tam olarak hangi koşullar altında ortaya çıktığını bulmaktan, uygulamayı [hata ayıklama çıktısı etkinleştirilerek](https://developer-old.gnome.org/glib/unstable/glib-running.html) çalıştırmaya, sorunu daraltan hata ayıklama çıktılarını koda eklemeye kadar gidebilir.

source: Suggesting features
tr: Özellik önerme

source: Most apps handle feature requests via the issue tracker as well. Note that implementing features and maintaining them as part of the codebase in the future can require a significant amount of additional work. Therefore, you should consider whether a new feature could even be relevant enough to be part of this app.
tr: Çoğu uygulama, özellik isteklerini de sorun izleyici aracılığıyla ele alır. Özelliklerin uygulamaya konması ve gelecekte kod tabanının parçası olarak sürdürülmesinin önemli ölçüde ek çalışma gerektirebileceğini unutmayın. Dolayısıyla, yeni özelliğin bu uygulamanın parçası olacak kadar ilgili olup olmadığını göz önünde bulundurmalısınız.
