Repository: Beryesa/foss-desktop-turkish
Catalog: GNOME/Infrastructure/ui.main.*.po
Languages: tr

source: When suggesting a new feature, it is helpful to focus on the question of what practical problem the feature should solve. Not on how the app should solve the problem or how exactly an implementation would look like. Preferably, you can also give a practical example where you needed the feature.
tr: Yeni özellik önerirken, uygulamanın sorunu nasıl çözmesi gerektiğine ya da bunun uyarlamasının tam olarak nasıl görüneceğine değil de, özelliğin hangi pratik sorunu çözmesi gerektiği konusuna odaklanmak daha yararlı olacaktır. Dilenirse, bu özelliğe gerek duyduğunuz pratik örnek de verebilirsiniz.

source: Catching issues and regressions before they land in a stable release is very valuable for a project. You can help with this by trying out an upcoming release. You can do this by trying out the nightly build of the app.
tr: Kararlı sürüme ulaşmadan önce sorunları ve gerilemeleri yakalamak, bir proje için çok değerlidir. Yaklaşan sürümleri deneyerek bu konuda yardımcı olabilirsiniz. Bunu, uygulamanın gecelik inşasını deneyerek yapabilirsiniz.

source: Finding a task
tr: Görev bulma

source: The issue tracker can also help you find open tasks you could tackle. Before implementing a new feature, it is usually a good idea to check in with the maintainers if merge requests for this feature would be accepted.
tr: Sorun izleyici, üstesinden gelebileceğiniz açık görevler bulmanıza da yardımcı olabilir. Yeni özelliği uygulamaya koymadan önce, bu özellik için birleştirme isteklerinin onaylanıp onaylanmayacağını bakımcılarla görüşerek doğrulamak genellikle iyi bir fikir olacaktır.

source: Working on the code
tr: Kod üzerinde çalışma

source: Whether you want to fix a typo, change the user interface, or work on the code of the app, the following information can help you get started. The first step will be to get the app built on your computer, allowing you to play around with your changes. Afterward, you can check the provided documentation on how to get respective tasks done. The subsequent section will show you how to submit your changes.
tr: İster yazım hatasını düzeltmek, ister kullanıcı arayüzünü değiştirmek, isterseniz de uygulamanın kodu üzerinde çalışmak isteyin, aşağıdaki bilgiler başlamanıza yardımcı olacaktır. İlk adım, uygulamanın bilgisayarınızda inşa edilmesini sağlayarak kendi değişikliklerinizle oynamanızı sağlamak olacaktır. Daha sonra, ilgili görevlerin nasıl yapılacağına ilişkin verilen belgeleri inceleyebilirsiniz. Sonraki bölüm size değişikliklerinizi nasıl göndereceğinizi gösterecektir.

source: If you are planning a somewhat larger change or addition to the app, it is often a good idea to check in with the maintainers of the app to find out if that change would be accepted. For this, you should first convince yourself that you can tackle the task at hand by doing the very first implementation steps and then check in with the maintainers via the issue tracker. This is also a good way to check if the project has an active maintainer who can accept your contribution. Despite our best efforts, not all projects are always continuously maintained.
tr: Uygulamada daha büyük çaplı değişiklik ya da ekleme yapmayı düşünüyorsanız, bu değişikliğin onaylanıp onaylanmayacağını öğrenmek için uygulamanın bakımcılarıyla görüşmek genellikle iyi bir fikir olacaktır. Bunun için öncelikle, ilk gerçekleştirme adımlarını atarak elinizdeki görevin üstesinden gelebileceğinize kendinizi inandırmalı ve ardından sorun izleyicisi aracılığıyla bakımcılarla görüşmelisiniz. Bu aynı zamanda projenin katkınızı onaylayabilecek etkin bir bakımcısı olup olmadığını denetlemek için de iyi bir yoldur. En iyi çabalarımıza karşın, tüm projelerin bakımı her zaman sürekli olarak yapılamamaktadır.

source: Note that while many community members are happy to help you out when you are stuck, maintainers oftentimes might not have the resources to guide you through a contribution.
tr: Birçok topluluk üyesi takıldığınızda size yardımcı olmaktan mutluluk duysa da, çoğu zaman bir katkıda bulunurken size kılavuzluk edebilecek kaynakları bulunmayabileceğini unutmayın.

source: Getting the app to build
tr: Uygulamanın inşası

source: This app also has tasks which are labeled with the “Newcomer” tag. Those tasks usually require less prior knowledge or are less complex.
tr: Bu uygulamada “Yeni Gelenler” etiketiyle imlenmiş görevler de bulunmaktadır. Bu görevler genellikle daha az ön bilgi gerektirir ya da daha az karmaşıktır.

source: When making changes to an app you will usually want to build and test the app with its changes on your computer. For most apps this process can be simplified a lot by using the Builder app.
tr: Uygulamada değişiklik yaparken genellikle uygulamayı değişiklikleriyle birlikte bilgisayarınızda inşa etmek ve sınamak istersiniz. Bu işlem, çoğu uygulama için Builder uygulamasını kullanarak kolaylaştırılabilir.

source: After starting Builder, you can choose to *clone* a project. This will download the app to your computer.
tr: Builder’ı başlattıktan sonra projeyi *klonlamayı* seçebilirsiniz. Bu, uygulamayı bilgisayarınıza indirecektir.

source: You have to enter the repository location. The correct URL can be copied from below.
tr: Depo konumunu girmeniz gerekir. Doğru URL’yi aşağıdan kopyalayabilirsiniz.

source: Depending on your internet connection and the size of the project, cloning the project might take a while. After Builder has completed this step, the project window should open. You might have to confirm the installation of some required dependencies. To try if you can successfully build and start the app, you can now press the “Run Project” button.
tr: İnternet bağlantınıza ve projenin boyutuna bağlı olarak, projeyi klonlamak biraz uzun sürebilir. Builder, bu adımı tamamladıktan sonra proje penceresi açılmalıdır. Bazı gerekli bağımlılıkların kurulumunu onaylamanız gerekebilir. Uygulamayı başarıyla inşa edip başlatıp başlatamayacağınızı denemek için şimdi “Projeyi Çalıştır” düğmesine basabilirsiniz.

source: If everything goes right, the app should be built. After the build has been completed, the built app should start automatically.
tr: Her şey yolunda giderse, uygulama sorunsuzca inşa edilmelidir. İnşa tamamlandıktan sonra, inşa edilen uygulama kendiliğinden başlamalıdır.

source: Python language
tr: Python dili

source: Rust language
tr: Rust dili

source: JavaScript language
tr: JavaScript dili

source: C language
tr: C dili

source: Vala language
tr: Vala dili

source: Setting up GitHub
tr: GitHub’ı ayarlama

source: Submitting your work
tr: Çalışmanızı gönderme

source: After making changes to a project, you can submit them for review. Our goal is to create what’s called a *merge request* or *pull request*. That means suggesting a change to a project’s code and data.
tr: Projede değişiklikler yaptıktan sonra bunları incelenmesi için gönderebilirsiniz. Amacımız *birleştirme isteği* ya da *gönderim isteği* denilen şeyi oluşturmaktır. Bu, bir projenin kodunda ve verilerinde değişiklik önermek anlamına gelir.

source: Setting up GitLab
tr: GitLab’ı ayarlama

source: Creating your own project copy
tr: Kendi proje kopyanızı oluşturma

source: where `<ssh-fork-url>` has to be replaced with the SSH URL you looked up in the previous step.
tr: burada `<ssh-fork-url>` bir önceki adımda baktığınız SSH URL’si ile değiştirilmelidir.

source: Creating a merge request
tr: Birleştirme isteği oluşturma

source: We now arrive at what are more regular tasks when working with git.
tr: Şimdi git ile çalışırken daha sıradan görevlere geliyoruz.

source: First, we want to switch to what’s called a different *branch*. Branches are variants of the original code where you can, for example, develop a feature, until it is ready to go into the actually used code. To do this you can call
tr: İlk önce, başka *dal* olarak adlandırdığımız yere geçmek istiyoruz. Dallar, örneğin gerçekte kullanılan koda girmeye uygun oluncaya dek bir özelliği geliştirebileceğiniz özgün kodun türevleridir. Bunu yapmak için şunu çağırabilirsiniz

source: where `my-changes` is a short description of what you are working on, without spaces.
tr: burada `my-changes` üzerinde çalıştığınız konunun boşluksuz kısa açıklamasıdır.

source: Next, we want to save the changes you made with git. That’s usually referred to as creating a *commit*. You can do this with the command
tr: Ardından, git ile yaptığınız değişiklikleri kaydetmek istiyoruz. Bu genellikle *işleme* oluşturmak olarak adlandırılır. Bunu şu komutla yapabilirsiniz

source: The commit messages should describe your changes. You can learn more about [choosing a fitting commit message](https://handbook.gnome.org/development/commit-messages.html).
tr: İşleme iletileri değişikliklerinizi açıklamalıdır. [Uygun bir işleme iletisi seçme](https://handbook.gnome.org/development/commit-messages.html) ile ilgili daha çok bilgi edinebilirsiniz.

source: Now, we have to get your saved changes onto GitLab. Luckily, we have already done all the setup with using `git remote add` in the previous section. All that’s left to do is now to call
tr: Şimdi, kaydettiğiniz değişiklikleri GitLab’e iletmemiz gerekiyor. Önceki bölümde `git remote add` kullanarak tüm kurulumu zaten yapmıştık. Şimdi geriye kalan tek işlem şunu çağırmak

source: We are finally at the last step. If you check the output in Console after our previous `git push` command, you will probably already see a website link showing you the way to create a *pull* or *merge request*. You can open it by pressing the *Ctrl* key while clicking on it. All that is left is to follow the website to finalize submitting your changes.
tr: İşte sonunda son adıma geldik. Önceki `git push` komutumuzdan sonra Konsol’daki çıktıyı incelerseniz, büyük olasılıkla *gönderim* ya da *birleştirme isteği* oluşturmanın yolunu gösteren web sitesi bağlantısı göreceksiniz. Üzerine tıklarken *Ctrl* tuşuna basarak açabilirsiniz. Geriye kalan tek işlem, değişikliklerinizi göndermeyi tamamlamak için web sitesini izlemektir.

source: Contribute to existing apps
tr: Var olan uygulamalara katkıda bulunma

source: Our community
tr: Topluluğumuz

source: A very warm welcome to the GNOME project. We want everyone to have an enjoyable and fulfilling experience. For this, the GNOME community prioritizes marginalized people’s safety over privileged people’s comfort. To learn more about how you can find support and what is expected from contributors, please have a look at our [GNOME Code of Conduct](https://conduct.gnome.org).
tr: GNOME projesine içtenlikle hoş geldiniz. Herkesin eğleneceği ve hoşnut kalacağı deneyim yaşamasını istiyoruz. Bunun için GNOME topluluğu; ayrımcılığa uğramış insanların güvenliğini, ayrıcalıklı insanların rahatlığına yeğler. Nasıl destek bulabileceğiniz ve katkıda bulunanlardan neler beklendiğiyle ilgili daha çok bilgi için lütfen [GNOME Davranış Kurallarına](https://conduct.gnome.org) göz atın.

source: Below, you can find instructions on how to build and work on specific apps. If you are not sure where to contribute, consider choosing an app that you use yourself or select a programming language with which you are already familiar. Try to solve a problem or implement a feature that is important to you or where you feel an inner motivation.
tr: Aşağıda, belirli uygulamaların nasıl inşa edileceği ve üzerinde nasıl çalışılacağıyla ilgili yönergeleri bulabilirsiniz. Nereye katkıda bulunabileceğinizden emin değilseniz, kullandığınız uygulamayı ya da zaten alışık olduğunuz programlama dilini seçmeyi düşünün. İçsel bir güdü duyduğunuz yere ya da sizin için önemli bir özelliği gerçekleştirmeye ya da bir sorunu çözmeye çalışın.

source: In GNOME we use Matrix chat to hang out together and discuss projects. You can get started in the [\#newcomers room](https://matrix.to/#/#newcomers:gnome.org) or directly reach out in a more specific chat room.
tr: GNOME’da birlikte takılmak ve projeleri tartışmak için Matrix konuşmasını kullanıyoruz. [\#newcomers odasından](https://matrix.to/#/#newcomers:gnome.org) başlayabilir ya da doğrudan daha özel konuşma odasına erişebilirsiniz.

source: Creating a new app
tr: Yeni uygulama oluşturma

source: Creating your own app will not only allow you to implement your own ideas at will. It is also an opportunity to understand how all the pieces in the GNOME ecosystem fit together.
tr: Kendi uygulamanızı oluşturmak yalnızca düşüncelerinizi istediğiniz gibi uygulamanızı sağlamakla kalmaz, aynı zamanda GNOME ekosistemindeki tüm parçaların birbirine nasıl uyduğunu anlamak için de olanak sunar.

source: It is possible to write apps for GNOME in several different programming languages. You can check our list of the [most frequently used languages](https://developer.gnome.org/documentation/introduction/languages.html).
tr: GNOME için birçok başka programlama dilinde uygulama yazılabilir. [En sık kullanılan diller](https://developer.gnome.org/documentation/introduction/languages.html) listemize göz atabilirsiniz.

source: You can publish your app on [Flathub](https://docs.flathub.org/docs/for-app-authors/submission/) to make it easily available to many people. If your app is polished and ready for everyday usage, you can consider submitting it to [GNOME Circle](https://circle.gnome.org). The Circle membership makes your project eligible for support through the GNOME Foundation.
tr: Uygulamanızı [Flathub](https://docs.flathub.org/docs/for-app-authors/submission/) üzerinde yayınlayarak birçok kişice kolayca erişilebilmesini sağlayabilirsiniz. Uygulamanız tam anlamıyla geliştirilmiş ve günlük kullanıma hazırsa, [GNOME Çevre](https://circle.gnome.org) üyeliğine başvurmayı düşünebilirsiniz. Çevre üyeliği, projenizi GNOME Vakfı aracılığıyla desteklenmeye uygun kılar.

source: Where to contribute
tr: Nereye katkıda bulunabilirsiniz

source: Within GNOME there are many areas where you can contribute and a plethora of skills that are appreciated.
tr: GNOME içinde katkıda bulunabileceğiniz pek çok alan ve değer verilen çok sayıda yetenek vardır.

source: Programming languages
tr: Programlama dilleri

source: Contribute to an app
tr: Uygulamaya katkı ver

source: Below, you can find an overview of the most popular languages for writing GNOME apps.
tr: Aşağıda, GNOME uygulamarı yazmak için en gözde dillere genel bakış bulabilirsiniz.

source: Below, you can find specific contribution guides for all GNOME apps. If you are not sure where to contribute, consider choosing an app that you use yourself. Try to solve something that is important to you or where you feel an inner motivation.
tr: Aşağıda, tüm GNOME uygulamaları için özel katkı kılavuzları bulabilirsiniz. Nereye katkıda bulunabileceğinizden emin değilseniz, kullandığınız bir uygulamayı ya da zaten alışık olduğunuz programlama dilini seçmeyi düşünün. Sizin için önemli olan ya da içsel bir güdü duyduğunuz bir konuyu çözmeye çalışın.

source: To get started with developing GNOME apps with C we recommend the [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) that also covers the C language. You can find other important resources below.
tr: C ile GNOME uygulamaları geliştirmeye başlamak için C dilini de kapsayan [Yeni Başlayanlar Eğitimini](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) öneriyoruz. Diğer önemli kaynakları aşağıda bulabilirsiniz.

source: Internships
tr: Stajlar

source: You can begin or continue your journey with GNOME with a remote internship including mentoring and a stipend. You can both choose from suggested projects or suggest your own.
tr: GNOME ile yolculuğunuza danışmanlık ve bursu içeren uzaktan staj ile başlayabilir ya da sürdürebilirsiniz. Önerilen projeler arasından seçim yapabilir ya da kendi projelerinizi önerebilirsiniz.

source: Something missing?
tr: Bir şey mi eksik?

source: The *Welcome to GNOME* pages are new. [Let us know](https://gitlab.gnome.org/Teams/Websites/welcome.gnome.org/-/issues) if you couldn’t find what you were hoping to find on this website.
tr: *GNOME’a Hoş Geldiniz* sayfaları yenidir. Bu web sitesinde umduğunuzu bulamadıysanız lütfen [bize bildirin.](https://gitlab.gnome.org/Teams/Websites/welcome.gnome.org/-/issues)

source: We recommend the [GJS Developer Guide](https://gjs.guide/guides/) to get started with JavaScript in GNOME. You can find other important resources below.
tr: GNOME’da JavaScript kullanmaya başlamak için [GJS Geliştirici Kılavuzunu](https://gjs.guide/guides/) öneriyoruz. Diğer önemli kaynakları aşağıda bulabilirsiniz.

source: If you are familiar with the basics of the [Python language](https://www.python.org/), we recommend the [Beginners Tutorial](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) which also covers the Python language. You can find other important resources below.
tr: [Python dilinin](https://www.python.org/) temellerine alışkınsanız, Python dilini de kapsayan [Yeni Başlayanlar Eğitimini](https://developer.gnome.org/documentation/tutorials/beginners/getting_started.html) öneririz. Diğer önemli kaynakları aşağıda bulabilirsiniz.

source: If you are familiar with the basics of the [Rust language](https://www.rust-lang.org), we recommend the online book [GUI development with Rust and GTK 4](https://gtk-rs.org/gtk4-rs/stable/latest/book/). This book explains how Rust can be used to create apps in the GNOME ecosystem. You can find other important resources below.
tr: [Rust dilinin](https://www.rust-lang.org) temellerine alışkınsanız, [Rust ve GTK 4 ile GUI geliştirme](https://gtk-rs.org/gtk4-rs/stable/latest/book/) adlı çevirim içi kitabı okumanızı öneririz. Bu kitap, GNOME ekosisteminde uygulamalar oluşturmak için Rust’ın nasıl kullanılabileceğini açıklamaktadır. Diğer önemli kaynakları aşağıda bulabilirsiniz.

source: The following apps are worth trying out to get started with development within GNOME. For more apps you can check the [Development Tools section](https://apps.gnome.org/#development) on *Apps for GNOME*.
tr: GNOME içinde geliştirmeye başlamada aşağıdaki uygulamalar denemeye değerdir. Daha çok uygulama için *GNOME İçin Uygulamalar* adresindeki [Geliştirme Araçları bölümüne](https://apps.gnome.org/#development) bakabilirsiniz.

source: The GNOME design team is responsible for GNOME user experience and visual design. This includes:
tr: GNOME tasarım takımı, GNOME kullanıcı deneyimi ve görsel tasarımından sorumludur. Bu, şunları içerir:

source: the design of the GNOME desktop, core apps, and app toolkit components
tr: GNOME masaüstü, çekirdek uygulamalar ve uygulama araç takımı bileşenlerinin tasarımı

source: icon and wallpaper design
tr: simge ve duvar kağıdı tasarımı

source: interface styling
tr: arayüz biçimlendirme

source: maintaining GNOME’s design guidelines
tr: GNOME tasarım kılavuzlarının bakımı

source: usability testing and research
tr: kullanılabilirlik sınaması ve araştırma

source: Help is needed in all of these areas, and contributions are welcome.
tr: Tüm bu alanlarda yardım gerekmekte olup, katkılarınız hoş karşılanacaktır.

source: Get involved
tr: Katıl

source: New contributors should join the GNOME design chat channel and see the GNOME design team GitLab space.
tr: Yeni katkıcılar GNOME tasarım konuşma kanalına katılmalı ve GNOME tasarım takımı GitLab alanını görmelidir.

source: GNOME design work happens in a variety of places, depending on the type of contribution:
tr: GNOME tasarım çalışmaları, katkının türüne bağlı olarak türlü yerlerde gerçekleşir:

source: To contribute directly to the design of an app or module, use its project in GitLab or its Matrix chat channel.
tr: Uygulama ya da modülün tasarımına doğrudan katkıda bulunmak için GitLab’deki projesini ya da Matrix konuşma kanalını kullanın.

source: Many contributions happen through discussion with other designers and developers, often in chat on Matrix.
tr: Birçok katkı, genellikle Matrix konuşmasında diğer tasarımcılar ve geliştiricilerle tartışılarak gerçekleşir.

source: Contributions to icons and wallpapers happen in dedicated GitLab projects, whose details can be found in [GNOME design team GitLab space](https://gitlab.gnome.org/Teams/Design).
tr: Simgelere ve duvar kağıtlarına yapılan katkılar, ayrıntıları [GNOME tasarım takımı GitLab alanında](https://gitlab.gnome.org/Teams/Design) bulunabilecek adanmış GitLab projelerinde gerçekleşir.

source: Ideas for design changes can be suggested in the [design team’s whiteboard project](https://gitlab.gnome.org/Teams/Design/whiteboards).
tr: Tasarım değişiklikleri için düşünceler, [tasarım takımının beyaz tahta projesinde](https://gitlab.gnome.org/Teams/Design/whiteboards) önerilebilir.

source: New user experience designs are stored and tracked in the team’s public mockup repositories, which can also be found in GitLab.
tr: Yeni kullanıcı deneyimi tasarımları, takımın GitLab’de de bulunabilen genel taslak depolarında saklanır ve izlenir.

source: Getting up to speed
tr: Bilgilenmek

source: Everyone who works on GNOME user experience and design should be familiar with:
tr: GNOME kullanıcı deneyimi ve tasarımında çalışan herkesin bunları bilmesi gerekir:

source: GNOME’s design guidelines, called the [GNOME Human Interface Guidelines](https://developer.gnome.org/hig/).
tr: GNOME’un [GNOME İnsan Arayüzü Yönergeleri](https://developer.gnome.org/hig/) olarak adlandırılan tasarım yönergeleri.

source: Existing GNOME design work, including the current state of GNOME itself, as well as our latest design work.
tr: GNOME’un güncel durumu ve en son tasarım çalışmalarımızı da içermek üzere var olan GNOME tasarım çalışmaları.

source: The posts in the design team’s [recommended reading list](https://hedgedoc.gnome.org/design-reading?view#), particularly those by Havoc Pennington (for some insight into the history behind GNOME design work).
tr: Tasarım takımının [önerilen okuma listesindeki](https://hedgedoc.gnome.org/design-reading?view#) gönderiler, özellikle Havoc Pennington tarafından yazılanlar (GNOME tasarım çalışmalarının arkasındaki geçmişe ilişkin bazı bilgiler için).

source: Participating in GNOME design does not entail any other requirements for experience or training. However, the role that you are able to play in GNOME design will depend on your existing level of expertise: experienced designers may be able to take on design initiatives relatively quickly, but if you are new to design work, you may need to gain experience on smaller tasks to begin with.
tr: GNOME tasarımına katılmak, başka herhangi bir deneyim veya eğitim gerektirmez. Bununla birlikte, GNOME tasarımında üstlenebileceğiniz görev sizin şu anki uzmanlık düzeyinize bağlı olacaktır: deneyimli tasarımcılar tasarım girişimlerini görece hızla üstlenebilirler, ancak tasarım işinde yeniyseniz başlangıçta daha küçük görevlerde deneyim kazanmanız gerekebilir.

source: Joining the team
tr: Takıma katılmak

source: Becoming a core member of the design team requires a time commitment, since you must work closely with the rest of the team and build up a detailed knowledge of our design language and practices. If this is something that you’d like to do, making contact with an existing team member for guidance is a good first step.
tr: Tasarım takımının çekirdek üyesi olmak, takımın geri kalanıyla yakından çalışmanız ve tasarım dilimiz ile uygulamalarımız ile ilgili ayrıntılı bilgi edinmenizi gerektirdiğinden, zaman ayırmanızı gerektirir. Bu, yapmak istediğiniz bir şeyse yol göstermesi için takımdaki bir üyeyle iletişime geçmek iyi bir ilk adım olacaktır.

source: Other ways to help
tr: Yardım etmenin diğer yolları
